# Data Acquisition & Summary

## Use seaborn to load the iris data set into a dataframe, df_iris

In [145]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pydataset
import seaborn as sns

In [146]:
iris = pydataset.data('iris')

In [147]:
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [148]:
iris.shape

(150, 5)

In [174]:
iris.columns
# [col.lower().replace('.', '_') for col in iris] change the column names. Period to a dash
# iris.columns = [col.lower().replace('.', '_') for col in iris] reassign column names to our dataframe

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [150]:
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [151]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

# Read the data tab from the stats module dataset, Excel_Stats.xlsx, into a dataframe, df_excel

In [182]:
# df_excel = pd.read_clipboard(sep='\t')
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,tenure,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0017-IUDMW,Female,0,Yes,Yes,72,2,2,2,Credit card (automatic),116.80,8456.75,No
1,0019-EFAEP,Female,0,No,No,72,2,2,2,Bank transfer (automatic),101.30,7261.25,No
2,0078-XZMHT,Male,0,Yes,No,72,2,1,2,Bank transfer (automatic),85.15,6316.20,No
3,0129-KPTWJ,Male,0,Yes,No,72,1,2,0,Electronic check,94.65,6747.35,No
4,0164-APGRB,Female,0,No,No,72,2,2,2,Electronic check,114.90,8496.70,No

In [183]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = iris.head(100)

In [184]:
# print the number of rows of your original dataframe
df_excel.shape

(7043, 13)

In [185]:
# print the column names that have a data type of object
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [186]:
# print the column names that have a data type of object
obj_col = list(df_excel.select_dtypes(include=['object']).columns)

In [187]:
# compute the range for each of the numeric variables.
df_excel.drop(obj_col, axis=1).max() - df_excel.drop(obj_col, axis=1).min()

is_senior_citizen       1.0
tenure                 72.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

# Read train.csv from google drive (shared through classroom in topic 'Classification') into a dataframe labeled df_google

In [158]:
df_google = pd.read_csv('train.csv')

In [159]:
# print the first 3 rows
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2/4/15 17:51,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2/4/15 17:51,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2/4/15 17:53,23.15,27.2450,426.0,713.50,0.004779,1

In [160]:
# print the number of rows and columns
df_google.shape

(8143, 8)

In [161]:
# print the column names
df_google.columns

Index(['rowid', 'date', 'Temperature', 'Humidity', 'Light', 'CO2',
       'HumidityRatio', 'Occupancy'],
      dtype='object')

In [162]:
# print the data type of each column
df_google.dtypes

rowid              int64
date              object
Temperature      float64
Humidity         float64
Light            float64
CO2              float64
HumidityRatio    float64
Occupancy          int64
dtype: object

In [163]:
# print the summary statistics for each of the numeric variables
df_google.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [164]:
# print the unique values for each of your categorical variables
df_google['date'].unique()

array(['2/4/15 17:51', '2/4/15 17:53', '2/4/15 17:54', ...,
       '2/10/15 9:30', '2/10/15 9:32', '2/10/15 9:33'], dtype=object)

# In mysql workbench or a terminal, write a query to select all the columns of titanic_db.passengers. Export that table to a csv you store locally. Read that csv into a dataframe df_csv.

In [165]:
df_csv = pd.read_csv(csv_str)

In [166]:
# print the head and tail of your new dataframe
df_csv.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [167]:
# print the head and tail of your new dataframe
df_csv.tail()

# pd.concat([df.head(), df.tail()]) prints out both head and tail at same time

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
886,886,0,2,male,27.0,0,0,13.00,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.00,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.45,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.00,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.75,Q,Third,NaN,Queenstown,1

In [168]:
# print the column names
df_csv.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [169]:
# print the data type of each column
df_csv.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [170]:
# print the summary statistics for each numeric variable
df_csv.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [212]:
# print the unique values for each categorical variables. If there are more than 5 distince values, print the top 5 in terms of prevelence or frequency.
   
for col in df_csv.select_dtypes(object):
    print(col, (df_csv[col].unique()[:5]))

sex ['male' 'female']
embarked ['S' 'C' 'Q' nan]
class ['Third' 'First' 'Second']
deck [nan 'C' 'E' 'G' 'D']
embark_town ['Southampton' 'Cherbourg' 'Queenstown' nan]

# Data Preparation

In [189]:
iris = pydataset.data('iris')
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa
4           4.6          3.1           1.5          0.2  setosa
5           5.0          3.6           1.4          0.2  setosa

In [204]:
[col.lower().replace('.', '_') for col in iris]
iris.columns = [col.lower().replace('.', '_') for col in iris] #Changes column names to lowercase and replaces the . with a _

sepal_area = (iris.sepal_length * iris.sepal_width)
iris['sepal_area'] = sepal_area #Creates new column for above 

petal_area = (iris.petal_length * iris.petal_width)
iris['petal_area'] = petal_area

df_with_area = [[petal_area, sepal_area]]

df_with_area = pd.DataFrame({'petal_area': sepal_area,
                   'sepal_area': petal_area})

In [205]:
df_with_area.head()

   petal_area  sepal_area
1       17.85        0.28
2       14.70        0.28
3       15.04        0.26
4       14.26        0.30
5       18.00        0.28

In [206]:
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_area,petal_area
1,5.1,3.5,1.4,0.2,setosa,17.85,0.28
2,4.9,3.0,1.4,0.2,setosa,14.70,0.28
3,4.7,3.2,1.3,0.2,setosa,15.04,0.26
4,4.6,3.1,1.5,0.2,setosa,14.26,0.30
5,5.0,3.6,1.4,0.2,setosa,18.00,0.28